wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/CMSIS/GD/GD32F50x/Source/system_gd32f50x.c
/*!
    \file  system_gd32f50x.c
    \brief CMSIS Cortex-M33 Device Peripheral Access Layer Source File for
           gd32f50x Device Series
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f50x.h"

/* system frequency define */
#define __IRC8M           (IRC8M_VALUE)            /* internal 8 MHz RC oscillator frequency */
#define __HXTAL           (HXTAL_VALUE)            /* high speed crystal oscillator frequency */
#define __SYS_OSC_CLK     (__IRC8M)                /* main oscillator frequency */

#define VECT_TAB_OFFSET  (uint32_t)0x00            /* vector table base offset */

/* select a system clock by uncommenting the following line */
#if (defined(GD32F503) || defined(GD32F505))
//#define __SYSTEM_CLOCK_IRC8M                    (uint32_t)(__IRC8M)
//#define __SYSTEM_CLOCK_HXTAL                    (uint32_t)(__HXTAL)
//#define __SYSTEM_CLOCK_200M_PLL_IRC8M           (uint32_t)(200000000)
//#define __SYSTEM_CLOCK_200M_PLL_HXTAL           (uint32_t)(200000000)
//#define __SYSTEM_CLOCK_220M_PLL_IRC8M           (uint32_t)(220000000)
//#define __SYSTEM_CLOCK_220M_PLL_HXTAL           (uint32_t)(220000000)
//#define __SYSTEM_CLOCK_252M_PLL_IRC8M           (uint32_t)(252000000)
#define __SYSTEM_CLOCK_252M_PLL_HXTAL           (uint32_t)(252000000)
#endif /* GD32F503 */

/* The following is to prevent Vcore fluctuations caused by frequency switching.
   It is strongly recommended to include it to avoid issues caused by self-removal. */
#define RCU_MODIFY_DE_2(__delay)   do{                                    \
                                    volatile uint32_t i, reg;             \
                                    if(0U != (__delay)){                  \
                                        /* Insert a software delay */     \
                                        for(i=0U; i<(__delay); i++){      \
                                        }                                 \
                                        reg = RCU_CFG0;                   \
                                        reg &= ~(RCU_CFG0_AHBPSC);        \
                                        reg |= RCU_AHB_CKSYS_DIV2;        \
                                        /* AHB = SYSCLK/2 */              \
                                        RCU_CFG0 = reg;                   \
                                        /* Insert a software delay */     \
                                        for(i=0U; i<(__delay); i++){      \
                                        }                                 \
                                        reg = RCU_CFG0;                   \
                                        reg &= ~(RCU_CFG0_AHBPSC);        \
                                        reg |= RCU_AHB_CKSYS_DIV4;        \
                                        /* AHB = SYSCLK/4 */              \
                                        RCU_CFG0 = reg;                   \
                                        /* Insert a software delay */     \
                                        for(i=0U; i<(__delay); i++){      \
                                        }                                 \
                                    }                                     \
                                }while(0U)

/* The following is to prevent Vcore fluctuations caused by frequency switching.
   It is strongly recommended to include it to avoid issues caused by self-removal. */
#define RCU_MODIFY_UP_2(__delay)  do{                                     \
                                      volatile uint32_t i,reg;            \
                                      if(0U != (__delay)){                \
                                          for(i=0U; i<(__delay); i++){    \
                                          }                               \
                                          reg = RCU_CFG0;                 \
                                          reg &= ~(RCU_CFG0_AHBPSC);      \
                                          reg |= RCU_AHB_CKSYS_DIV2;      \
                                          RCU_CFG0 = reg;                 \
                                          /* Insert a software delay */   \
                                          for(i=0U; i<(__delay); i++){    \
                                          }                               \
                                          reg = RCU_CFG0;                 \
                                          reg &= ~(RCU_CFG0_AHBPSC);      \
                                          reg |= RCU_AHB_CKSYS_DIV1;      \
                                          RCU_CFG0 = reg;                 \
                                          /* Insert a software delay */   \
                                          for(i=0U; i<(__delay); i++){    \
                                          }                               \
                                      }                                   \
                                  }while(0U)

